In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({"chave1" : ["a", "a", None, "b", "b", "a", None],
                   "chave2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
                   "dados1" : [-0.204708, 0.478943, -0.519439, -0.555730, 1.965781, 1.393406, 0.092908],
                   "dados2" : [0.281746, 0.769023, 1.246435, 1.007189, -1.296221, 0.274992, 0.228913]})
df

  chave1  chave2    dados1    dados2
0      a       1 -0.204708  0.281746
1      a       2  0.478943  0.769023
2   None       1 -0.519439  1.246435
3      b       2 -0.555730  1.007189
4      b       1  1.965781 -1.296221
5      a    <NA>  1.393406  0.274992
6   None       1  0.092908  0.228913

In [8]:
df.sort_values('chave1')

  chave1  chave2    dados1    dados2
0      a       1 -0.204708  0.281746
1      a       2  0.478943  0.769023
5      a    <NA>  1.393406  0.274992
3      b       2 -0.555730  1.007189
4      b       1  1.965781 -1.296221
2   None       1 -0.519439  1.246435
6   None       1  0.092908  0.228913

In [18]:
df.groupby(['chave2', 'chave1']).agg({'dados1': lambda x: x.sum()})

                 dados1
chave2 chave1
1      a      -0.204708
       b       1.965781
2      a       0.478943
       b      -0.555730

In [32]:
df.groupby(['chave1']).agg({'chave1': ['nunique', 'count', 'sum']})

        chave1
       nunique count  sum
chave1
a            1     3  aaa
b            1     2   bb

In [29]:
df[['chave1', 'chave2']].groupby(['chave1']).sum()

        chave2
chave1
a            3
b            3

In [ ]:
deputados_despesas_23.groupby('nome').agg('vlrLiquido', 'sum')

In [20]:
df['chave2']

0       1
1       2
2       1
3       2
4       1
5    <NA>
6       1
Name: chave2, dtype: Int64

In [35]:
df

  chave1  chave2    dados1    dados2
0      a       1 -0.204708  0.281746
1      a       2  0.478943  0.769023
2   None       1 -0.519439  1.246435
3      b       2 -0.555730  1.007189
4      b       1  1.965781 -1.296221
5      a    <NA>  1.393406  0.274992
6   None       1  0.092908  0.228913

In [38]:
df[['dados1', 'dados2']].apply(lambda linha: linha.iloc[0]**2, axis='columns')

0    0.041905
1    0.229386
2    0.269817
3    0.308836
4    3.864295
5    1.941580
6    0.008632
dtype: float64

In [37]:
df

  chave1  chave2    dados1    dados2
0      a       1 -0.204708  0.281746
1      a       2  0.478943  0.769023
2   None       1 -0.519439  1.246435
3      b       2 -0.555730  1.007189
4      b       1  1.965781 -1.296221
5      a    <NA>  1.393406  0.274992
6   None       1  0.092908  0.228913

In [36]:
df[['dados1', 'dados2']].apply(lambda coluna: coluna.iloc[0]**2 + coluna.iloc[1]**3, axis='rows')

dados1    0.151768
dados2    0.534178
dtype: float64

In [39]:
df[['dados1', 'dados2']].groupby(df['chave1']).apply(lambda grupo: grupo.iloc[0]**2)

          dados1    dados2
chave1
a       0.041905  0.079381
b       0.308836  1.014430

In [40]:
df[['dados1', 'dados2']].groupby(df['chave1'])